## Data Wrangling
Data wrangling is the process of converting raw data into a usable form

Data Pre-Processing, Data Cleansing, Data Wrangling

#### Data Cleaning or Pre-Processing

- Starting from Raw Data
- Then Collect Data
- Clean Data
- Filter Data
- Delete Missing Data
- Tied up Data
- Join Data
- Split Up Data 
- Duplicate Removal
- And alot of others method to clean the Data

Before Processing the data Analysis

## Data Wrangling Content

- Handling missing values
- Data Formatting
- Data Normalization
    -- Scaling 
    -- Centralizing
- Data Binning
    -- for groups of data
- Making dummies of categorical data
    -- Categorical ----> Numerical

In [1]:
# import libraries
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
kashti = sns.load_dataset('titanic')
ks1 = kashti
ks2 = kashti

In [3]:
ks1.shape

(891, 15)

In [4]:
kashti.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
# Simple Math operations (Math Operator)
(kashti['age']+1).head()

0    23.0
1    39.0
2    27.0
3    36.0
4    36.0
Name: age, dtype: float64

___

## Dealing with Missing values
- In a dataset missing values are either? or N/A or NaN, or 0 or a blank cell

### Steps
- Collect data again or analyze the data if there is any mistake.
- Remove missing values (column) if it doesn't effect your data and analysis or simply remove
  rows or data entry which has missing values.
- Replace the missing values:
    1. How?
        1. Average value of entire variable or similar data point
        2. Frequently or MODE replacement
        3. Replace based on other functions (Data Sampler knows that)
        4. ML Algo can also be used (Linear Regression etc)
        5. Leave it like that
    2. Why?
        1. Its better because no data is lost
        2. Less accurate

In [6]:
# where exactly are missing values
kashti.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [7]:
# use drop na method
print(kashti.shape)
kashti.dropna(subset=['deck'], axis=0, inplace=True) # specifically removes the deck column rows
# inplace = True -> modifies the original data frame

(891, 15)

In [8]:
# now check again the missing values
kashti.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [9]:
# remove NA from whole data frame
kashti = kashti.dropna()
kashti.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [10]:
kashti.shape

(182, 15)

### Now Checking for KS1

In [11]:
ks1.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

## Replacing missing values with the average of that column

In [12]:
# finding an average mean
mean = ks1['age'].mean()
mean

35.77945652173913

In [13]:
ks1['age'] = ks1['age'].replace(np.nan, mean)

In [14]:
ks1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

In [15]:
# now replacing deck with its mean values
# Categoricals are a pandas data type corresponding to categorical variables in statistics. 
# A categorical variable takes on a limited, and usually fixed, number of possible values ( categories ; levels in R). 
#Examples are gender, social class, blood type, country affiliation, observation time or rating via Likert scales.

# find the mode of the 'deck' column
mode = ks1['deck'].mode()[0]
print("Mode:", mode)

Mode: C

In [16]:
# inplace will bring change to original data frame
ks1['deck'].fillna(mode, inplace=True)

In [17]:
ks1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

In [18]:
# remove NaN values which are left
ks1 = ks1.dropna()
ks1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

___

## Data Formatting

- Bring data to one common standard.
- Ensure data is consistent and understandable
    1. Easy to gather
    2. Easy to work with
        1. Peshawar (PEW)
        2. Islamabad (ISB)
        3. Karachi (KCH)
        4. Lahore (LHR)
        5. Convert g to kg or similar units
        6. One Standard unit in each column
        7. ft != cm

In [19]:
# know the data type and convert it into known one
ks1.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [20]:
# type casting - converting the datatype from one form to another
ks1['age'] = ks1['age'].astype("float64")
# ks1.loc[:, 'age'] = ks1['age'].astype("float64")
ks1.dtypes

C:\Users\Uzair Afridi\AppData\Local\Temp\ipykernel_6376\245240165.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ks1['age'] = ks1['age'].astype("float64")

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [21]:
# here we will convert age to days
ks1.loc[:, 'age'] = ks1['age'] * 365
ks1.head()

C:\Users\Uzair Afridi\AppData\Local\Temp\ipykernel_6376\3836463320.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ks1.loc[:, 'age'] = ks1['age'] * 365

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,13870.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,12775.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,19710.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,1460.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,21170.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [22]:
# removing the zeros from age int to float
ks1.loc[:, 'age'] = ks1['age'].astype("int64")
ks1.dtypes

C:\Users\Uzair Afridi\AppData\Local\Temp\ipykernel_6376\270489114.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ks1.loc[:, 'age'] = ks1['age'].astype("int64")

survived          int64
pclass            int64
sex              object
age               int64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [23]:
# now age we got in days
ks1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,13870,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,12775,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,19710,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,1460,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,21170,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [24]:
# always rename afterwards
ks1.rename(columns={'age':'age in days'}, inplace=True)
ks1.head()

C:\Users\Uzair Afridi\AppData\Local\Temp\ipykernel_6376\188320174.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ks1.rename(columns={'age':'age in days'}, inplace=True)

,survived,pclass,sex,age in days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,13870,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,12775,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,19710,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,1460,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,21170,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

## Data Normalization

- Uniorm the data
- They have same impact
- One whale fish in Sea and one fish in jar
- We do this so that comparison can be easy.